## SQLite 3

In [1]:
import sqlite3

In [2]:
## Connect to an SQLite database
connection = sqlite3.connect('example.db')
connection

In [3]:
cursor = connection.cursor()

In [4]:
## Create a Table
cursor.execute(''' 
CREATE TABLE IF NOT EXISTS employees(
               ID Integer primary key,
               name Text Not Null,
               age Integer,
               department text)
''')

## Commit the Changes
connection.commit()

In [7]:
## Create a Table
cursor.execute(''' 
SELECT * FROM employees
''')

In [6]:
## Insert the Data in SQLite Table
cursor.execute('''
INSERT INTO employees(name, age, department)
            values('Navneet', 25, 'Data Scientist')
''')

cursor.execute('''
INSERT INTO employees(name, age, department)
            values('Manish', 23, 'Data Engineer')
''')

cursor.execute('''
INSERT INTO employees(name, age, department)
            values('Ubaid', 23, 'Data Engineer')
''')

connection.commit()

In [8]:
## Querying the Data from SQLite
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()

## Print the Query
for row in rows:
    print(row)

(1, 'Navneet', 25, 'Data Scientist')
(2, 'Manish', 23, 'Data Engineer')
(3, 'Ubaid', 23, 'Data Engineer')

In [9]:
## Update the data in the Table
cursor.execute('''
UPDATE employees 
               SET age = 34
               WHERE name = 'Ubaid'
''')

connection.commit()

In [10]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Navneet', 25, 'Data Scientist')
(2, 'Manish', 23, 'Data Engineer')
(3, 'Ubaid', 34, 'Data Engineer')

In [11]:
## Delete the Data from the table
cursor.execute('''
DELETE FROM employees
               WHERE name = 'Manish'
''')

connection.commit()

In [12]:
cursor.execute('SELECT * FROM employees')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Navneet', 25, 'Data Scientist')
(3, 'Ubaid', 34, 'Data Engineer')

## Working with Sales Data

In [14]:
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

## Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
               ID Integer Primary Key,
               Date Text Not Null,
               Product Text Not Null,
               Sales Integer,
               Region Text)
''')

## Insert Data
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

connection.executemany('''
INSERT INTO sales(date, product, sales, region)
                       VALUES(?,?,?,?)
''', sales_data)

connection.commit()

In [16]:
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [17]:
## Close the Connection
connection.close()